{
    "php": [
        {
            "icon": "images/icons/php_32px.png",
            "title": "PHP",
            "text": "<p>PHP (англ. PHP: Hypertext Preprocessor — «PHP: препроцессор гипертекста»; первоначально PHP/FI (Personal Home Page / Form Interpreter), а позже названный Personal Home Page Tools — «Инструменты для создания персональных веб-страниц») — скриптовый язык общего назначения, интенсивно применяемый для разработки веб-приложений. В настоящее время поддерживается подавляющим большинством хостинг-провайдеров и является одним из лидеров среди языков, применяющихся для создания динамических веб-сайтов.</p><p>Язык и его интерпретатор (Zend Engine) разрабатываются группой энтузиастов в рамках проекта с открытым кодом. Проект распространяется под собственной лицензией, несовместимой с GNU GPL.</p>"
        },
        {
            "author": "Колесников Д.",
            "title": "Разработка веб-приложений на PHP 8",
            "image": "images/books/php/Kolesnikov_D._-_Razrabotka_veb-prilozhenij_na_PHP_8.png",
            "description": "На практических примерах описано создание веб-приложений на языке РНР версии 8.х. Даны начала разработки на РНР: установка и настройка Apache 2.4, РНР, MySQL и кросс-платформенной сборки ХАМРР, выбор редактора РНР-кода, синтаксис языка, самые полезные функции и нововведения РНР 8.х. Рассмотрено создание веб-приложений с использованием популярного фреймворка Laravel и шаблонизатора Blade. В качестве хранилища данных использованы два сервера - самая современная версия MySQL и набирающая популярность СУБД MoпgoDB. Раскрыты особенности создания индикатора загрузки файла и разыменовывания массивов, приведены примеры устранения типичных SЕО-ошибок, допускаемых программистами, описана работа с PDO, JSON, МР3, Curl, MoЬileDetec. Особое внимание уделяется безопасности веб-приложений - рассматривается, как уберечь их от основных атак, как установить SSL-сертификат и уберечь сам сервер от неприятностей.",
            "file": "../books/php/Kolesnikov_D._-_Razrabotka_veb-prilozhenij_na_PHP_8.pdf"
        },
        {
            "author": "Котеров Д. В., Симдянов И. В.",
            "title": "PHP 8. Наиболее полное руководство (в подлиннике)",
            "image": "images/books/php/Koterov_D._V._Simdyanov_I._V._-_PHP_8._Naibolee_polnoe_rukovodstvo_(V_podlinnike)_-_2023.png",
            "description": "PHP 8. Наиболее полное руководство (в подлиннике)",
            "file": "../books/php/Koterov_D._V.,_Simdyanov_I._V._-_PHP_8._Naibolee_polnoe_rukovodstvo_(V_podlinnike)_-_2023.pdf"
        },
        {
            "author": "Эрик А. Манн",
            "title": "Рецепты PHP. Для профессиональных разработчиков",
            "image": "images/books/php/Erik_A._Mann_-_Recepty_PHP_Dlya_professional'nyh_razrabotchikov.png",
            "description": "Рецепты PHP. Для профессиональных разработчиков",
            "file": "../books/php/Mann_-_Recepty_PHP_Dlya_professionalnyh_razrabotchikov.pdf"
        }
    ],
    "javascript": [
        {
            "icon": "images/icons/javascript_32px.png",
            "title": "JavaScript",
            "text": "<p>JavaScript (англ. /ˈdʒɑːvəskrɪpt/; аббр. JS) — мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript (стандарт ECMA-262).</p><p>JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений. Наиболее широкое применение находит в браузерах как язык сценариев для придания интерактивности веб-страницам.</p><p>Основные архитектурные черты: динамическая типизация, слабая типизация, автоматическое управление памятью, прототипное программирование, функции как объекты первого класса.</p><p>На JavaScript оказали влияние многие языки, при разработке была цель сделать язык похожим на Java. Языком JavaScript не владеет какая-либо организация или компания, что отличает его от ряда языков программирования, используемых в веб-разработке.</p><p>Название «JavaScript» является зарегистрированным товарным знаком корпорации Oracle в США.</p><p>В 1992 году компания Nombas (впоследствии приобретённая Openwave[англ.]) начала разработку встраиваемого скриптового языка Cmm (Си-минус-минус), который, по замыслу разработчиков, должен был стать достаточно мощным, чтобы заменить макросы, сохраняя при этом схожесть с Си, чтобы разработчикам не составляло труда изучить его. Главным отличием от Си была работа с памятью. В новом языке всё управление памятью осуществлялось автоматически: не было необходимости создавать буфера, объявлять переменные, осуществлять преобразование типов. В остальном языки сильно походили друг на друга: в частности, Cmm поддерживал стандартные функции и операторы Си. Cmm был переименован в ScriptEase, поскольку исходное название звучало слишком негативно, а упоминание в нём Си «отпугивало» людей. На основе этого языка был создан проприетарный продукт CEnvi. В конце ноября 1995 года Nombas разработала версию CEnvi, внедряемую в веб-страницы. Страницы, которые можно было изменять с помощью скриптового языка, получили название Espresso Pages — они демонстрировали использование скриптового языка для создания игры, проверки пользовательского ввода в формы и создания анимации. Espresso Pages позиционировались как демоверсия, призванная помочь представить, что случится, если в браузер будет внедрён язык Cmm. Работали они только в 16-битовом Netscape Navigator под управлением Windows.</p><p>Самая первая реализация JavaScript была создана Бренданом Эйхом (англ. Brendan Eich) в компании Netscape, и с тех пор обновляется, чтобы соответствовать ECMA-262 Edition 5 и более поздним версиям. Этот движок называется SpiderMonkey и реализован на языке C/C++. Движок Rhino создан Норрисом Бойдом (англ. Norris Boyd) и реализован на языке Java. Как и SpiderMonkey, Rhino соответствует ECMA-262 Edition 5.</p>"
        },
        {
            "author": "Флэнаган Д.",
            "title": "JavaScript. Полное руководство, 7-е издание - 2021",
            "image": "images/books/javascript/Flanagan_D._-_JavaScript._The_Complete_Guide,_7th_Edition_-_2021.png",
            "description": "JavaScript. Полное руководство, 7-е издание - 2021"
        },
        {
            "author": "Никольский А. П.",
            "title": "JavaScript на примерах. Практика, практика и только практика",
            "image": "images/books/javascript/JavaScript_na_primerakh_Praktika_praktika_i_tolko_praktika_2018.png",
            "description": "JavaScript на примерах. Практика, практика и только практика"
        },
        {
            "author": "Васильев А. Н.",
            "title": "Программирование на JavaScript в примерах и задачах",
            "image": "images/books/javascript/Vasil'ev_A._N._-_JavaScript_v_primerah_i_zadachah.png",
            "description": "Программирование на JavaScript в примерах и задачах"
        }
    ]
}